digital-codes/uiflow-micropython/m5stack/boards/M5STACK_StampC5/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME    "M5Stack StampC5"
#define MICROPY_HW_MCU_NAME      "ESP32C5"

#define MICROPY_HW_ENABLE_SDCARD (0)
#define MICROPY_PY_MACHINE_I2S   (0)

#define MICROPY_HW_I2C0_SCL      (1)
#define MICROPY_HW_I2C0_SDA      (2)
